const msHistoryOrderDetail = {
    //用户信息-四个标题-后端返回数据的文案
    cardTitle: {
        //标题
        callBook: '本地通讯录',//本地通讯录
        message: '本地短信',//本地短信
        callRecord: '通话记录',//通话记录
        reviewInfo: '审核信息',//审核信息
    },
     //审核信息 表头
     columnAuditInfoTitle: {
        0: '审核时间',//审核时间
        1: '审核阶段',//审核阶段
        2: '审核结果',//审核结果
        3: '审核人员',//审核人员
        4: '审核意见',//审核意见
    },
    //审核阶段
    auditLevel: {
        0: '未审核',//未审核
        1: '初审阶段',//初审阶段
        4: '机审阶段',//机审阶段
        5: '终审阶段',//终审阶段
    },
    //审核结果
    auditResult: {
        0: '未审核',//未审核
        1: '初审通过',//初审通过
        4: '机审通过',//机审通过
        5: '终审通过',//终审通过
    },
    //用户信息-本地通讯录-表头
    userCallBookTitle: {
        0: '姓名',//姓名
        1: '电话',//电话
        2: '用户联系次数',//用户联系次数
        3: '总呼叫次数',//总呼叫次数
        4: '今日呼叫次数'//今日呼叫次数
    },
    //用户信息-本地短信-表头
    userMessageTitle: {
        0: '姓名',//姓名
        1: '电话', //电话
        2: '收发时间',//收发时间
        3: '已读',//已读
        4: '短信类型',//短信类型
        5: '短信内容',//短信内容
        6: '短信翻译',//短信翻译
    },

    //用户信息-本地通话记录-表头
    userCallRecordTitle: {
        0: '姓名',//姓名
        1: '手机号',//手机号
        2: '通话时间',//通话时间
        3: '通话时长',//通话时长
        4: '通话类型',//通话类型
        5: '通话状态',//通话状态
    },
    //拒绝、通过
    actionText: [
        {
            key: '2',
            value: '失联'
        }, {
            key: '3',
            value: '欺诈'
        },{
            key: '4',
            value: '无还款意愿'
        },{
            key: '5',
            value: '承诺还款'
        },{
            key: '6',
            value: '上门催收'
        },{
            key: '10',
            value: '联系人转告'
        },{
            key: '11',
            value: '资金困难'
        },
    ],
    //反馈情况
    feedbackList: [
        {
            key: '0',
            value: '表示没钱，可以延后还款'//表示没钱，可以延后还款
        }, {
            key: '1',
            value: '表示只归还本金'//表示只归还本金
        },{
            key: '2',
            value: '现在没工作，没收入还款'//现在没工作，没收入还款
        },{
            key: '3',
            value: '亲属或者朋友表示可以帮其归还欠款'//亲属或者朋友表示可以帮其归还欠款
        },{
            key: '4',
            value: '客户明确告知就是不还款'//客户明确告知就是不还款
        },{
            key: '5',
            value: '联系不上客户本人，亲属或者朋友可以帮助告知还款'//联系不上客户本人，亲属或者朋友可以帮助告知还款
        },{
            key: '6',
            value: '客户失联'
        },{
            key: '7',
            value: '其他'
        }
    ],
    searchResultTip: {
        0: '查看', //查看
        1: '无数据' ,//'暂无数据'
        2: '暂无筛选数据' ,//'暂无筛选数据'
        3: '请选择'
    },
    tableContent: { //表格内字段
        haveRead: '已读',//已读
        unread: '未读',//未读
        receive: '接收',//接收
        send: '发送',//发送
        h: '小时',//小时
        m: '分钟',//分钟
        s: '秒',//秒
        out:'呼出',//呼出
        in:'呼入',//呼入
        no: '未接通',//未接通
        unknown: '未知',//未知
    },
}

export default msHistoryOrderDetail